---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/c1mep01/Work/childtaxcredit_proj_sfmp/work/logs/Untitled.log
  log type:  text
 opened on:  11 May 2023, 16:02:50

. do "/state/partition1/statatempdump/SD11975.000000"

. ** test regression
. regress lnftotval age c.hh_lfp##i.hefaminc i.race i.max_educ i.min_educ i.numadult_bin i.marital i.sex i.numkid_bin i.spo
> usemp fownu6 i.h_tenure i.ftype

      Source |       SS           df       MS      Number of obs   =   113,063
-------------+----------------------------------   F(57, 113005)   =   1728.48
       Model |  65766.0088        57  1153.78963   Prob > F        =    0.0000
    Residual |  75432.7007   113,005  .667516488   R-squared       =    0.4658
-------------+----------------------------------   Adj R-squared   =    0.4655
       Total |   141198.71   113,062  1.24886089   Root MSE        =    .81702

----------------------------------------------------------------------------------------
             lnftotval | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
                   age |   .0034453   .0001868    18.45   0.000     .0030792    .0038114
               hh_lfp1 |   .7818435   .0468904    16.67   0.000     .6899391    .8737479
                       |
              hefaminc |
                    2  |   .2438837   .0469343     5.20   0.000     .1518931    .3358743
                    3  |   .1745948    .037442     4.66   0.000      .101209    .2479805
                    4  |   .2716376   .0355759     7.64   0.000     .2019095    .3413658
                    5  |   .4104549   .0358498    11.45   0.000     .3401899    .4807199
                    6  |   .4306412   .0329148    13.08   0.000     .3661287    .4951537
                    7  |   .4706611   .0321534    14.64   0.000     .4076408    .5336813
                    8  |   .5689843   .0329885    17.25   0.000     .5043273    .6336413
                    9  |   .6165541   .0324611    18.99   0.000     .5529308    .6801774
                   10  |   .6599105   .0331582    19.90   0.000     .5949209    .7249002
                   11  |   .7205593   .0313522    22.98   0.000     .6591095    .7820091
                   12  |   .8894895   .0319075    27.88   0.000     .8269514    .9520277
                   13  |    .916167   .0315145    29.07   0.000     .8543991     .977935
                   14  |   1.052371   .0314508    33.46   0.000     .9907275    1.114014
                   15  |   1.222617   .0320431    38.16   0.000     1.159813    1.285421
                   16  |   1.512343   .0329417    45.91   0.000     1.447778    1.576909
                       |
    hefaminc#c.hh_lfp1 |
                    2  |  -.1703754   .0789314    -2.16   0.031    -.3250798   -.0156709
                    3  |  -.1587751   .0702976    -2.26   0.024    -.2965573    -.020993
                    4  |  -.1855714    .063495    -2.92   0.003    -.3100207   -.0611221
                    5  |  -.2283134   .0642067    -3.56   0.000    -.3541576   -.1024693
                    6  |   -.290093   .0578304    -5.02   0.000    -.4034397   -.1767463
                    7  |   -.255432   .0551531    -4.63   0.000    -.3635311   -.1473328
                    8  |  -.2277729   .0554958    -4.10   0.000    -.3365438   -.1190019
                    9  |  -.2026121   .0542285    -3.74   0.000    -.3088993    -.096325
                   10  |  -.1577115   .0546312    -2.89   0.004    -.2647879   -.0506352
                   11  |  -.1812133   .0520722    -3.48   0.001    -.2832739   -.0791526
                   12  |  -.2799266   .0521793    -5.36   0.000    -.3821973    -.177656
                   13  |  -.1949169   .0513854    -3.79   0.000    -.2956315   -.0942022
                   14  |  -.2207474   .0509278    -4.33   0.000    -.3205652   -.1209296
                   15  |  -.2114603   .0511123    -4.14   0.000    -.3116397   -.1112809
                   16  |  -.1987436    .051711    -3.84   0.000    -.3000964   -.0973908
                       |
                  race |
                    2  |  -.0729005   .0078141    -9.33   0.000    -.0882161   -.0575849
                    3  |  -.0018615   .0081087    -0.23   0.818    -.0177545    .0140315
                       |
              max_educ |
              HS grad  |   .1980245   .0145271    13.63   0.000     .1695515    .2264975
            some coll  |   .2815271   .0146036    19.28   0.000     .2529044    .3101499
            Bachelors  |   .4408617   .0151588    29.08   0.000     .4111507    .4705727
              Adv deg  |   .5916188   .0158434    37.34   0.000      .560566    .6226715
                       |
              min_educ |
              HS grad  |   .0636727   .0099908     6.37   0.000      .044091    .0832545
            some coll  |   .0846528   .0111893     7.57   0.000     .0627218    .1065838
            Bachelors  |   .1002442   .0129191     7.76   0.000      .074923    .1255654
              Adv deg  |    .144923   .0174023     8.33   0.000     .1108147    .1790313
                       |
          numadult_bin |
                    2  |   .0707815   .0117618     6.02   0.000     .0477285    .0938344
                    3  |      .2663   .0129183    20.61   0.000     .2409803    .2916197
                    4  |   .4239339   .0139908    30.30   0.000     .3965122    .4513556
                       |
             1.marital |   .1290914   .0086864    14.86   0.000     .1120661    .1461166
                 2.sex |  -.0665728   .0049559   -13.43   0.000    -.0762863   -.0568593
                       |
            numkid_bin |
                    1  |   .0174279   .0105936     1.65   0.100    -.0033354    .0381911
                    2  |   .0464269   .0108811     4.27   0.000     .0251001    .0677538
                    4  |   .0159385   .0182349     0.87   0.382    -.0198016    .0516786
                       |
            1.spousemp |    .060484   .0082953     7.29   0.000     .0442253    .0767427
                fownu6 |  -.0340082    .005926    -5.74   0.000    -.0456231   -.0223933
                       |
              h_tenure |
                 Rent  |  -.1527735   .0062413   -24.48   0.000    -.1650063   -.1405408
         No cash rent  |  -.1794103   .0238018    -7.54   0.000    -.2260614   -.1327591
                       |
                 ftype |
Nonfamily householder  |  -.4029014   .0119159   -33.81   0.000    -.4262564   -.3795464
  Unrelated subfamily  |  -.7952666   .0538444   -14.77   0.000    -.9008008   -.6897325
 Secondary individual  |  -.9681512    .012075   -80.18   0.000     -.991818   -.9444844
                       |
                 _cons |   9.212592   .0332178   277.34   0.000     9.147486    9.277698
----------------------------------------------------------------------------------------

. 
. predict p, xb
(2,803 missing values generated)

. g p_ftotval = exp(p)
(2,803 missing values generated)

. g p_resid = abs(ftotval - p_ftotval)
(2,803 missing values generated)

. sum p_resid

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     p_resid |    114,918    44333.07    89279.77   .9453125    2168006

. 
end of do-file

. log close
      name:  <unnamed>
       log:  /home/c1mep01/Work/childtaxcredit_proj_sfmp/work/logs/Untitled.log
  log type:  text
 closed on:  11 May 2023, 16:03:59
---------------------------------------------------------------------------------------------------------------------------
