-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\c1mep01\OneDrive - FR Banks\madison_cps\do\fromShigeru\kids_lfpr.log
  log type:  text
 opened on:  30 Mar 2023, 15:02:41

. do "C:\Users\c1mep01\AppData\Local\Temp\STD50fc_000000.tmp"

. 
. ** all people with kids vs. no kids
. table (yearmth) (haskid) [fweight=pwsswgt], statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |          haskid       
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202103 |  75.22   28.18   74.19
  202104 |  75.04   29.34   74.06
  202105 |  75.14   31.10   74.21
  202106 |  75.71   37.44   74.92
  202107 |  76.10   40.79   75.37
  202108 |  75.82   36.80   74.98
  202109 |  75.68   32.60   74.72
  202110 |  75.96   30.82   74.97
  202111 |  76.06   30.24   75.02
  202112 |  75.81   27.96   74.76
  202201 |  75.60   29.65   74.58
  202202 |  75.94   30.13   74.92
  202203 |  76.24   29.50   75.20
  202204 |  75.81   30.05   74.78
  Total  |  75.72   31.68   74.76
---------------------------------

. 
. table (yearmth) (hasyoungkid) [fweight=pwsswgt], statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |       hasyoungkid     
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202103 |  73.92   75.41   74.19
  202104 |  73.75   75.41   74.06
  202105 |  73.98   75.23   74.21
  202106 |  74.69   75.93   74.92
  202107 |  75.09   76.62   75.37
  202108 |  74.74   76.05   74.98
  202109 |  74.50   75.73   74.72
  202110 |  74.67   76.35   74.97
  202111 |  74.68   76.51   75.02
  202112 |  74.34   76.59   74.76
  202201 |  74.21   76.18   74.58
  202202 |  74.56   76.50   74.92
  202203 |  74.85   76.76   75.20
  202204 |  74.32   76.80   74.78
  Total  |  74.45   76.15   74.76
---------------------------------

. 
. ** women only
. table (yearmth) (haskid) [fweight=pwsswgt] if pesex==2, statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |          haskid       
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202103 |  70.06   30.90   69.22
  202104 |  69.58   29.85   68.76
  202105 |  69.65   33.83   68.93
  202106 |  70.07   37.46   69.42
  202107 |  70.24   42.31   69.69
  202108 |  70.06   37.41   69.37
  202109 |  70.10   33.02   69.27
  202110 |  70.66   33.01   69.84
  202111 |  70.84   32.49   69.98
  202112 |  70.67   30.67   69.83
  202201 |  70.43   32.39   69.63
  202202 |  70.41   30.02   69.57
  202203 |  70.91   31.58   70.07
  202204 |  70.43   30.69   69.58
  Total  |  70.29   33.20   69.51
---------------------------------

. 
. table (yearmth) (hasyoungkid) [fweight=pwsswgt] if pesex==2, statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |       hasyoungkid     
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202103 |  70.39   64.51   69.22
  202104 |  69.82   64.47   68.76
  202105 |  70.26   63.40   68.93
  202106 |  70.52   64.93   69.42
  202107 |  70.70   65.51   69.69
  202108 |  70.61   64.24   69.37
  202109 |  70.52   64.23   69.27
  202110 |  70.82   65.84   69.84
  202111 |  70.88   66.33   69.98
  202112 |  70.69   66.35   69.83
  202201 |  70.60   65.66   69.63
  202202 |  70.62   65.26   69.57
  202203 |  71.10   65.91   70.07
  202204 |  70.45   66.10   69.58
  Total  |  70.57   65.20   69.51
---------------------------------

. 
end of do-file

. log off
      name:  <unnamed>
       log:  C:\Users\c1mep01\OneDrive - FR Banks\madison_cps\do\fromShigeru\kids_lfpr.log
  log type:  text
 paused on:  30 Mar 2023, 15:03:03
-------------------------------------------------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\c1mep01\OneDrive - FR Banks\madison_cps\do\fromShigeru\kids_lfpr.log
  log type:  text
resumed on:  30 Mar 2023, 15:03:30

. do "C:\Users\c1mep01\AppData\Local\Temp\STD50fc_000000.tmp"

. 
. ** all people with kids vs. no kids
. table (yearmth) (haskid) [fweight=pwsswgt], statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |          haskid       
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202105 |  75.62   36.72   74.82
  202106 |  75.88   38.80   75.10
  202107 |  76.12   39.94   75.37
  202108 |  75.55   34.77   74.68
  Total  |  75.79   37.54   74.99
---------------------------------

. 
. table (yearmth) (hasyoungkid) [fweight=pwsswgt], statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |       hasyoungkid     
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202105 |  74.92   74.32   74.82
  202106 |  75.11   75.03   75.10
  202107 |  75.37   75.37   75.37
  202108 |  74.71   74.50   74.68
  Total  |  75.03   74.81   74.99
---------------------------------

. 
. ** women only
. table (yearmth) (haskid) [fweight=pwsswgt] if pesex==2, statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |          haskid       
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202105 |  70.02   39.42   69.44
  202106 |  70.22   43.04   69.69
  202107 |  70.26   47.47   69.83
  202108 |  69.73   35.77   69.07
  Total  |  70.06   41.40   69.51
---------------------------------

. 
. table (yearmth) (hasyoungkid) [fweight=pwsswgt] if pesex==2, statistic(mean LF) nformat(%5.2fc)

---------------------------------
         |       hasyoungkid     
         |      0       1   Total
---------+-----------------------
yearmth  |                       
  202105 |  71.25   61.64   69.44
  202106 |  71.30   62.84   69.69
  202107 |  71.28   63.79   69.83
  202108 |  70.66   62.52   69.07
  Total  |  71.12   62.70   69.51
---------------------------------

. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\c1mep01\OneDrive - FR Banks\madison_cps\do\fromShigeru\kids_lfpr.log
  log type:  text
 closed on:  30 Mar 2023, 15:03:46
-------------------------------------------------------------------------------------------------------------------------------------------------------------
