-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/c1mep01/Work/childtaxcredit_proj_sfmp/work/logs/Untitled.log
  log type:  text
 opened on:  15 May 2023, 17:45:23

. do "/state/partition1/statatempdump/SD368392.000000"

. table income_cat (), statistic(min unlog_ftotval) statistic(mean unlog_ftotval)

--------------------------------------------------------
                             |  Minimum value       Mean
-----------------------------+--------------------------
5 quantiles of unlog_ftotval |                          
  1                          |       1450.465   20898.85
  2                          |       30476.37   40258.35
  3                          |       50227.16   62358.55
  4                          |       75822.24    94910.3
  5                          |         119253   167398.3
  Total                      |       1450.465   77164.48
--------------------------------------------------------

. 
end of do-file

. do "/state/partition1/statatempdump/SD368392.000000"

. 
. table income_cat (yearmth), statistic(mean LF) nformat(%5.2fc)

-------------------------------------------------------------------------------------------------------------------------------------------------
                             |                                                       yearmth                                                     
                             |  202101   202102   202103   202104   202105   202106   202107   202108   202109   202110   202111   202112   Total
-----------------------------+-------------------------------------------------------------------------------------------------------------------
5 quantiles of unlog_ftotval |                                                                                                                   
  1                          |    0.47     0.43     0.43     0.44     0.43     0.43     0.44     0.44     0.44     0.44     0.44     0.43    0.44
  2                          |    0.54     0.54     0.54     0.55     0.55     0.55     0.55     0.55     0.56     0.56     0.56     0.55    0.55
  3                          |    0.59     0.63     0.63     0.63     0.62     0.61     0.62     0.62     0.63     0.63     0.63     0.63    0.62
  4                          |    0.66     0.70     0.69     0.69     0.70     0.69     0.70     0.70     0.69     0.69     0.69     0.69    0.69
  5                          |    0.75     0.78     0.78     0.78     0.78     0.78     0.78     0.77     0.77     0.77     0.77     0.78    0.77
  Total                      |    0.61     0.61     0.61     0.61     0.61     0.61     0.62     0.61     0.61     0.62     0.62     0.61    0.61
-------------------------------------------------------------------------------------------------------------------------------------------------

. 
. table income_cat advCTC, stat(mean LF) nformat(%5.2fc) // overall

---------------------------------------------------
                             |         advCTC      
                             |     0      1   Total
-----------------------------+---------------------
5 quantiles of unlog_ftotval |                     
  1                          |  0.44   0.44    0.44
  2                          |  0.55   0.56    0.55
  3                          |  0.62   0.63    0.62
  4                          |  0.69   0.69    0.69
  5                          |  0.77   0.77    0.77
  Total                      |  0.61   0.62    0.61
---------------------------------------------------

. 
. table income_cat advCTC if numkid>=1, stat(mean LF) nformat(%5.2fc) // parents

---------------------------------------------------
                             |         advCTC      
                             |     0      1   Total
-----------------------------+---------------------
5 quantiles of unlog_ftotval |                     
  1                          |  0.60   0.62    0.61
  2                          |  0.68   0.68    0.68
  3                          |  0.73   0.75    0.74
  4                          |  0.79   0.80    0.79
  5                          |  0.83   0.84    0.84
  Total                      |  0.75   0.76    0.75
---------------------------------------------------

. 
. table income_cat advCTC if numkid>=1 & marital==1, stat(mean LF) nformat(%5.2fc) // married parents

---------------------------------------------------
                             |         advCTC      
                             |     0      1   Total
-----------------------------+---------------------
5 quantiles of unlog_ftotval |                     
  1                          |  0.50   0.52    0.51
  2                          |  0.61   0.61    0.61
  3                          |  0.73   0.74    0.73
  4                          |  0.81   0.81    0.81
  5                          |  0.86   0.87    0.86
  Total                      |  0.78   0.78    0.78
---------------------------------------------------

. 
. table income_cat advCTC if numkid>=1 & marital==0, stat(mean LF) nformat(%5.2fc) // unmarried parents

---------------------------------------------------
                             |         advCTC      
                             |     0      1   Total
-----------------------------+---------------------
5 quantiles of unlog_ftotval |                     
  1                          |  0.63   0.65    0.64
  2                          |  0.73   0.75    0.74
  3                          |  0.74   0.76    0.75
  4                          |  0.71   0.74    0.72
  5                          |  0.66   0.65    0.65
  Total                      |  0.69   0.71    0.70
---------------------------------------------------

. 
. table income_cat advCTC if numkid>=1 & sex==2, stat(mean LF) nformat(%5.2fc) // women with kids

---------------------------------------------------
                             |         advCTC      
                             |     0      1   Total
-----------------------------+---------------------
5 quantiles of unlog_ftotval |                     
  1                          |  0.55   0.57    0.56
  2                          |  0.61   0.61    0.61
  3                          |  0.64   0.66    0.64
  4                          |  0.70   0.71    0.70
  5                          |  0.76   0.77    0.77
  Total                      |  0.67   0.68    0.67
---------------------------------------------------

. 
end of do-file

. log close
      name:  <unnamed>
       log:  /home/c1mep01/Work/childtaxcredit_proj_sfmp/work/logs/Untitled.log
  log type:  text
 closed on:  15 May 2023, 17:46:45
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
